import React from "react";
import styles from "./StylesForSingle.module.css";
import goverla from "./img/mainGoverla.jpg";
import { Link } from "react-router-dom";

export default function Goverla() {
  return (
    <>
      <div className={styles.main}>
        <div className={styles.block}>
          <img className={styles.img} src={goverla} alt="" />
          <p>
            Походження назви гори суперечливе[2]. Українські мовознавці
            переважно стверджують, що топонім «Говерла» походить із рум.
            howârla, що означає «важкопрохідне підняття»[2][3][4]. Деякі джерела
            виводять назву гори від угор. hóvár — «сніговий замок»[5], але
            набагато ймовірнішою є думка, що угорське найменування — це
            модифікація української назви[6]. Угорські джерела на межі XIX— XX
            ст. згадують гору під іменем Hoverla[7], водночас в «Етимологічному
            словнику географічних назв» не наведено назви Hóvár[6]. Угорське
            походження малоймовірне й через те, що, за сучасними даними, на горі
            ніколи не було замку, а модифікація Hoverla — Hóvár не має
            задовільного лінгвістичного пояснення[6]. Найвірогідніше, назва
            Hóvár з'явилася близько 1940 року одночасно з мадяризацією деяких
            інших топонімів Закарпаття та Мармарощини[6].
          </p>
          <Link to="/">
            <button className={styles.btn}>Назад</button>
          </Link>
        </div>
      </div>
    </>
  );
}
